import random
from colorama import Fore

def fill_terminal(version):
    rand_color_num = random.randrange(0, 3)
    if rand_color_num == 0:
      print(Fore.BLUE + f"""                 
                                                
                       .c,                      
                      .,;.                      
                                                
                                                
               .',;,,'''.'',,;;,..              
            ';,..  ....  .....  ..;;.           
         .:,. ........  . ......... .;,.        
       .:, ............  ............  ;,       
      'c. ......... ........  ......... .:.     
     .c  .......... '. ... '. .......... .:     
     c. .  .   .  . '. ll; '. .. .   .. . ,,    
    .l .. .  ..  .. '. ''. '. .  . ...  . .c    
    .l ..  ..  . .. ''.....'. .  ... .. ' .c    
    .l .. .      .. ',,,,'... .  .     .' .c    
    .c ............ .'''''''. ........... .:    
                                                
      Ласкаво просимо до інтерпретатора Based!
      Версія: {version}
      Девіз: Простота - найвища форма
      досконалості.
      """)

    elif rand_color_num == 1:
        print(Fore.YELLOW + f"""                 
                                                
                       .c,                      
                      .,;.                      
                                                
                                                
               .',;,,'''.'',,;;,..              
            ';,..  ....  .....  ..;;.           
         .:,. ........  . ......... .;,.        
       .:, ............  ............  ;,       
      'c. ......... ........  ......... .:.     
     .c  .......... '. ... '. .......... .:     
     c. .  .   .  . '. ll; '. .. .   .. . ,,    
    .l .. .  ..  .. '. ''. '. .  . ...  . .c    
    .l ..  ..  . .. ''.....'. .  ... .. ' .c    
    .l .. .      .. ',,,,'... .  .     .' .c    
    .c ............ .'''''''. ........... .:    
                                                
      Ласкаво просимо до інтерпретатора Based!
      Версія: {version}
      Девіз: Забудь про фреймворки, обійми
      свою базову сутність з Based.
      """)

    elif rand_color_num == 2:
        print(Fore.GREEN + f"""                 
                                                
                       .c,                      
                      .,;.                      
                                                
                                                
               .',;,,'''.'',,;;,..              
            ';,..  ....  .....  ..;;.           
         .:,. ........  . ......... .;,.        
       .:, ............  ............  ;,       
      'c. ......... ........  ......... .:.     
     .c  .......... '. ... '. .......... .:     
     c. .  .   .  . '. ll; '. .. .   .. . ,,    
    .l .. .  ..  .. '. ''. '. .  . ...  . .c    
    .l ..  ..  . .. ''.....'. .  ... .. ' .c    
    .l .. .      .. ',,,,'... .  .     .' .c    
    .c ............ .'''''''. ........... .:    
                                                
      Ласкаво просимо до інтерпретатора Based!
      Версія: {version}
      Девіз: Based - єдина мова, де ти буквально
      програмуєш на базі.
      """)

    elif rand_color_num == 3:
        print(Fore.BLACK + f"""                 
                                                
                       .c,                      
                      .,;.                      
                                                
                                                
               .',;,,'''.'',,;;,..              
            ';,..  ....  .....  ..;;.           
         .:,. ........  . ......... .;,.        
       .:, ............  ............  ;,       
      'c. ......... ........  ......... .:.     
     .c  .......... '. ... '. .......... .:     
     c. .  .   .  . '. ll; '. .. .   .. . ,,    
    .l .. .  ..  .. '. ''. '. .  . ...  . .c    
    .l ..  ..  . .. ''.....'. .  ... .. ' .c    
    .l .. .      .. ',,,,'... .  .     .' .c    
    .c ............ .'''''''. ........... .:    
                                                
      Ласкаво просимо до інтерпретатора Based!
      Версія: {version}
      Девіз: З Based ти завжди базуєшся на
      своїх базових знаннях.
      """)

    print(Fore.WHITE)